{
  "basics": {
    "name": "Nishant Kaushik",
    "email": "kaushiknishant1996@gmail.com",
    "phone": {
        "india":"+91 8080973330",
        "uae": "+971 567942587"
    },
    "resume_url":"https://firebasestorage.googleapis.com/v0/b/portfolio-8d931.appspot.com/o/NishantKaushikResume_UAE.pdf?alt=media&token=02182f96-4ca9-41b5-980d-5d472b40bdd6",
    "profile_img":"",
    "website": "https://nishant201296.github.io/",
    "current_location": "Abu Dhabi, UAE",
    "socials":{
      "twitter":"https://x.com/nishant_on_code",
      "linkedin":"https://www.linkedin.com/in/kaushiknishant1996/",
      "website":"",
      "github":"https://github.com/nishant201296"
    }
  },
  "summary":"Software engineer skilled in problem-solving, robust architecture design, focused on mobile with experience in leading remote teams across time zones",
  "work": [
    {
      "company": "CoLearn",
      "position": "Lead Engineer (Promoted & Relocated)",
      "website": "https://colearn.id/",
      "highlights": [
        "Led mobile team in building and optimizing interfaces, delivering product stories, and implementing cross-platform web pages with reusable components using the React Native Web framework.",
        "Reduced adoption time, sped up store reviews, and lowered operation costs by implementing Live Updates in native Android and iOS apps using React Native components as web pages.",
        
        "Reduced backend scaling costs and app load time by 50% through implementing a caching system by leveraging AWS S3, Lambda, and CDN.",
        "Automated push notifications using Google Cloud Function and Firebase Cloud Messaging, reducing backend dependency.",
        "Migrated CI/CD pipelines from AppCenter to Azure pipelines, reducing operation cost."
      ],
      "location": "Abu Dhabi, UAE",
      "startDate": "Aug 2023",
      "endDate": "Present"
    },
    {
      
      "company": "CoLearn",
      "position": "Senior Software Engineer",
      "website": "https://colearn.id/",
      "highlights": [
       "Optimized placements to boost user engagement and revenue by using Google Ad Manager to serve pre-roll and banner ads.",
       "Launched purchase flows via Google play & App store to enable ads-free experience on app, boosting monetization.",
       "Revised and modularized old codebases using MVVM and Clean Architecture, and improving functionality and maintainability.",
       "Integrated a CI/CD pipeline using GitHub actions and App Center, streamlining the development workflow and enhancing deployment efficiency.",
       "Implemented unit testing and advanced debugging to maintain 99.90% crash- free sessions and conducted Code Reviews.",
       "Improved code quality and teamwork with regular pair programming.",
       "Worked on a Push based QnA feature to work along with Zoom Meeting for live sessions using RTDB."
      ],
      "location": "Remote, India",
      "startDate": "Apr 2022",
      "endDate": "Aug 2023"
    },
    {
      "highlights": [
        "Worked on a wearable app using Wear OS and an Android app to show current Cricket scores for ESPN CricInfo with more than 10 Million downloads.",
        "Consulted at CoLearn, significantly improving their Android app's engagement and performance. Hired full-time for delivering exceptional results and showcasing technical expertise and strong collaboration skills."
      ],
      "company": "Procedure Tech.",
      "position": "Senior Software Engineer",
      "website": "https://procedure.tech/",
      "location": "Mumbai, India",
      "startDate": "Apr 2021",
      "endDate": "Apr 2022"
    },
    {
      "highlights": [
        "Built mobile app using Native Android and Flutter technologies.",
        "Built an Android app as an interface for managing physical and virtual, gift and reload-able cards.",
        "Using Multi-factor-Auth built an android app serving as IDP and for User KYC feature.",
        "Implemented REST API calls to get relevant data from the app's server.",
        "Used MVVM pattern improve code architecture."
      ],
      "company": "Finclusion Services Pvt. Ltd.",
      "position": "Software Developer",
      "location": "Mumbai, India",
      "startDate": "Dec 2018",
      "endDate": "Apr 2021"
    }
  ]
}
